# Packages
brew "btop"
brew "coreutils"
brew "curl"
brew "fastfetch"
brew "fzf"
brew "git"
brew "jemalloc"
brew "jq"
brew "libpq"
brew "libyaml"
brew "mise"
brew "overmind"
brew "pnpm"
brew "postgresql@17"
brew "uv"
brew "vips"
brew "wget"
brew "zsh"
brew "redis"

# Cask applications
cask "claude"
cask "cursor"
cask "discord"
cask "docker"
cask "ghostty"
cask "iterm2"
cask "netnewswire"
cask "obsidian"
cask "orbstack"
cask "pearcleaner"
cask "vlc"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-geist-mono"
